Repository: faceknows/edgevane-ios
Catalog: Moneyknows/Platform/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# trade.add
source: Add symbols
zh_hans: 添加代码

# trade.empty
source: No live quotes yet
zh_hans: 还没有实时订阅

# trade.emptyBody
source: Add a symbol to watch minute and second charts together.
zh_hans: 添加代码后即可同时看分钟图和秒图。

# trade.placeholder
source: Live subscriptions come in a later slice.
zh_hans: 实时订阅将在后续切片接入。

# trade.subscribeFailed
source: Could not subscribe
zh_hans: 订阅失败

# trade.symbolsRequired
source: Enter at least one symbol
zh_hans: 请输入至少一个代码

# trade.title
source: Live quotes
zh_hans: 实时订阅

# trade.unsubscribeFailed
source: Could not unsubscribe
zh_hans: 退订失败

# trading.addCredentialsBody
source: Market data still works. Add brokerage credentials in Settings to see portfolio, positions, and orders.
zh_hans: 行情仍可用。请到设置填写券商凭证后查看组合、持仓和订单。

# trading.allowStopLoss
source: Allow auto stop loss for this symbol
zh_hans: 允许该标的自动止损

# trading.allowTakeProfit
source: Allow auto take profit for this symbol
zh_hans: 允许该标的自动止盈

# trading.autoExitFailed
source: Could not place auto %@ for %@: %@
zh_hans: 未能挂自动%@（%@）：%@

# trading.autoExitKind
source: take profit / stop loss
zh_hans: 止盈止损

# trading.autoExitPlaced
source: Placed auto %@ for %@
zh_hans: 已挂自动%@（%@）

# trading.blocked
source: This account cannot trade
zh_hans: 当前账户禁止交易

# trading.blockStopLoss
source: Skip auto stop loss for this symbol
zh_hans: 该标的不自动止损

# trading.blockTakeProfit
source: Skip auto take profit for this symbol
zh_hans: 该标的不自动止盈

# trading.buy
source: Buy
zh_hans: 买入

# trading.buyAtBid
source: Buy @ Bid
zh_hans: 按买价买入

# trading.cancelOpenOrders
source: Cancel open orders for this symbol
zh_hans: 同时撤销该标的未完成单

# trading.confirmMessage
source: %@ · %@ · %@ · %@ shares · %@
zh_hans: %@ · %@ · %@ · %@股 · %@

# trading.confirmTitle
source: Confirm order
zh_hans: 确认下单

# trading.credentialsInvalid
source: Brokerage credentials are no longer valid
zh_hans: 券商凭证已失效

# trading.credentialsInvalidBody
source: Update Key and Secret in Settings. Lists will not auto-refresh until they work again.
zh_hans: 请在设置中更新 Key 和 Secret。凭证有效之前不会自动刷新。

# trading.extendedHours
source: Include extended hours
zh_hans: 盘前盘后有效

# trading.filledAvg
source: Filled
zh_hans: 成本

# trading.goToCredentials
source: Open credentials
zh_hans: 去填写凭证

# trading.invalidPrice
source: Enter a valid price.
zh_hans: 请输入有效价格。

# trading.invalidQuantity
source: Quantity must be at least 1 share.
zh_hans: 数量至少为 1 股。

# trading.invalidSymbol
source: Enter a valid symbol.
zh_hans: 请输入有效股票代码。

# trading.limitClose
source: Limit close
zh_hans: 限价平仓

# trading.liquidateLimit
source: Liquidate @ Limit
zh_hans: 限价平仓

# trading.marketClose
source: Market flatten
zh_hans: 市价全平

# trading.maxOrderValue
source: This order exceeds the maximum order value.
zh_hans: 超过单笔上限。

# trading.noPosition
source: No open position for this symbol.
zh_hans: 该标的没有持仓。

# trading.openPosition
source: Open Position
zh_hans: 当前持仓

# trading.orderAccepted
source: %@ accepted
zh_hans: %@ 已接受

# trading.orderCanceled
source: %@ canceled
zh_hans: %@ 已取消

# trading.orderFilled
source: %@ filled
zh_hans: %@ 已成交

# trading.orderHistoryIncomplete
source: Couldn't load the complete fill history.
zh_hans: 无法加载完整成交记录

# trading.orderRejected
source: %@ rejected
zh_hans: %@ 被拒绝

# trading.otoBuy
source: OTO buy
zh_hans: OTO 买入

# trading.otoSell
source: OTO sell
zh_hans: OTO 卖出

# trading.otoSpread
source: Take-profit must be at least $0.01 from the entry price.
zh_hans: 止盈价距入场价至少 0.01 美元。

# trading.positionType
source: Type
zh_hans: 方向

# trading.price
source: Price
zh_hans: 价格

# trading.protectionRestoreFailed
source: Could not restore exit orders for %@: %@. Position may be unprotected.
zh_hans: 未能恢复 %@ 的保护单：%@。仓位可能没有止盈止损。

# trading.protectionWindow
source: Wait %d more minutes after the open before trading.
zh_hans: 开盘后还需等待 %d 分钟才能下单。

# trading.quantity
source: Shares
zh_hans: 股数

# trading.sell
source: Sell
zh_hans: 卖出

# trading.sellAtAsk
source: Sell @ Ask
zh_hans: 按卖价卖出

# trading.sliderHint
source: Drag to pick a limit price, then confirm on release.
zh_hans: 拖动选择限价，松手后确认。

# trading.sliderTitle
source: Slider limit
zh_hans: 滑条限价

# trading.stop
source: Stop
zh_hans: 止损

# trading.stopLoss
source: Stop loss
zh_hans: 止损

# trading.stopLossKind
source: stop loss
zh_hans: 止损

# trading.stopQtyAvailable
source: Available
zh_hans: 可用

# trading.stopQtyCustom
source: Custom
zh_hans: 自定义

# trading.stopQtyTotal
source: All
zh_hans: 全部

# trading.submit
source: Review order
zh_hans: 核对订单

# trading.submitFailed
source: Could not place the order
zh_hans: 下单失败

# trading.takeProfit
source: Take profit
zh_hans: 止盈

# trading.takeProfitKind
source: take profit
zh_hans: 止盈

# trading.takeProfitPrice
source: Take-profit price
zh_hans: 止盈价

# trading.waitingForPrice
source: Waiting for price...
zh_hans: 等待价格中...

# version.checking
source: Checking app version…
zh_hans: 正在检查版本…

# version.failed
source: Unable to confirm whether this app version is still supported.
zh_hans: 无法确认当前版本是否仍受支持。

# version.openStore
source: Open App Store
zh_hans: 前往 App Store

# version.updateRequired
source: Please update to continue.
zh_hans: 请更新后再使用。
